Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/dma.h
/* -------- DMA_DBGCTRL : (DMA Offset: 0x08) (R/W 32) DEBUG CONTROL REGISTER -------- */
#define DMA_DBGCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (DMA_DBGCTRL) DEBUG CONTROL REGISTER  Reset Value */

#define DMA_DBGCTRL_DBGRUN_Pos                _UINT32_(0)                                          /* (DMA_DBGCTRL) Debug Run Position */
#define DMA_DBGCTRL_DBGRUN_Msk                (_UINT32_(0x1) << DMA_DBGCTRL_DBGRUN_Pos)            /* (DMA_DBGCTRL) Debug Run Mask */
#define DMA_DBGCTRL_DBGRUN(value)             (DMA_DBGCTRL_DBGRUN_Msk & (_UINT32_(value) << DMA_DBGCTRL_DBGRUN_Pos)) /* Assigment of value for DBGRUN in the DMA_DBGCTRL register */
#define DMA_DBGCTRL_Msk                       _UINT32_(0x00000001)                                 /* (DMA_DBGCTRL) Register Mask  */


/* -------- DMA_CRCPOLYA : (DMA Offset: 0x0C) (R/W 32) DMA CRC POLYNOMIAL A REGISTER -------- */
#define DMA_CRCPOLYA_RESETVALUE               _UINT32_(0x00)                                       /*  (DMA_CRCPOLYA) DMA CRC POLYNOMIAL A REGISTER  Reset Value */

#define DMA_CRCPOLYA_POLYA_Pos                _UINT32_(0)                                          /* (DMA_CRCPOLYA) CRC Polynomial Coefficients A Register Position */
#define DMA_CRCPOLYA_POLYA_Msk                (_UINT32_(0xFFFFFFFF) << DMA_CRCPOLYA_POLYA_Pos)     /* (DMA_CRCPOLYA) CRC Polynomial Coefficients A Register Mask */
#define DMA_CRCPOLYA_POLYA(value)             (DMA_CRCPOLYA_POLYA_Msk & (_UINT32_(value) << DMA_CRCPOLYA_POLYA_Pos)) /* Assigment of value for POLYA in the DMA_CRCPOLYA register */
#define DMA_CRCPOLYA_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (DMA_CRCPOLYA) Register Mask  */


/* -------- DMA_CRCPOLYB : (DMA Offset: 0x10) (R/W 32) DMA CRC POLYNOMIAL B REGISTER -------- */
#define DMA_CRCPOLYB_RESETVALUE               _UINT32_(0x00)                                       /*  (DMA_CRCPOLYB) DMA CRC POLYNOMIAL B REGISTER  Reset Value */

#define DMA_CRCPOLYB_POLYB_Pos                _UINT32_(0)                                          /* (DMA_CRCPOLYB) CRC Polynomial Coefficients B Register Position */
#define DMA_CRCPOLYB_POLYB_Msk                (_UINT32_(0xFFFFFFFF) << DMA_CRCPOLYB_POLYB_Pos)     /* (DMA_CRCPOLYB) CRC Polynomial Coefficients B Register Mask */
#define DMA_CRCPOLYB_POLYB(value)             (DMA_CRCPOLYB_POLYB_Msk & (_UINT32_(value) << DMA_CRCPOLYB_POLYB_Pos)) /* Assigment of value for POLYB in the DMA_CRCPOLYB register */
#define DMA_CRCPOLYB_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (DMA_CRCPOLYB) Register Mask  */


/* -------- DMA_INTSTAT4 : (DMA Offset: 0x14) ( R/ 32) DMA INTERRUPT PRIORITY 4 STATUS REGISTER -------- */
#define DMA_INTSTAT4_RESETVALUE               _UINT32_(0x00)                                       /*  (DMA_INTSTAT4) DMA INTERRUPT PRIORITY 4 STATUS REGISTER  Reset Value */

#define DMA_INTSTAT4_CH0_Pos                  _UINT32_(0)                                          /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH0_Msk                  (_UINT32_(0x1) << DMA_INTSTAT4_CH0_Pos)              /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH0(value)               (DMA_INTSTAT4_CH0_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH0_Pos)) /* Assigment of value for CH0 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH1_Pos                  _UINT32_(1)                                          /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH1_Msk                  (_UINT32_(0x1) << DMA_INTSTAT4_CH1_Pos)              /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH1(value)               (DMA_INTSTAT4_CH1_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH1_Pos)) /* Assigment of value for CH1 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH2_Pos                  _UINT32_(2)                                          /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH2_Msk                  (_UINT32_(0x1) << DMA_INTSTAT4_CH2_Pos)              /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH2(value)               (DMA_INTSTAT4_CH2_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH2_Pos)) /* Assigment of value for CH2 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH3_Pos                  _UINT32_(3)                                          /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH3_Msk                  (_UINT32_(0x1) << DMA_INTSTAT4_CH3_Pos)              /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH3(value)               (DMA_INTSTAT4_CH3_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH3_Pos)) /* Assigment of value for CH3 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH4_Pos                  _UINT32_(4)                                          /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH4_Msk                  (_UINT32_(0x1) << DMA_INTSTAT4_CH4_Pos)              /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH4(value)               (DMA_INTSTAT4_CH4_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH4_Pos)) /* Assigment of value for CH4 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH5_Pos                  _UINT32_(5)                                          /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH5_Msk                  (_UINT32_(0x1) << DMA_INTSTAT4_CH5_Pos)              /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH5(value)               (DMA_INTSTAT4_CH5_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH5_Pos)) /* Assigment of value for CH5 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH6_Pos                  _UINT32_(6)                                          /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH6_Msk                  (_UINT32_(0x1) << DMA_INTSTAT4_CH6_Pos)              /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH6(value)               (DMA_INTSTAT4_CH6_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH6_Pos)) /* Assigment of value for CH6 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH7_Pos                  _UINT32_(7)                                          /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH7_Msk                  (_UINT32_(0x1) << DMA_INTSTAT4_CH7_Pos)              /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH7(value)               (DMA_INTSTAT4_CH7_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH7_Pos)) /* Assigment of value for CH7 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH8_Pos                  _UINT32_(8)                                          /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH8_Msk                  (_UINT32_(0x1) << DMA_INTSTAT4_CH8_Pos)              /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH8(value)               (DMA_INTSTAT4_CH8_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH8_Pos)) /* Assigment of value for CH8 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH9_Pos                  _UINT32_(9)                                          /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH9_Msk                  (_UINT32_(0x1) << DMA_INTSTAT4_CH9_Pos)              /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH9(value)               (DMA_INTSTAT4_CH9_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH9_Pos)) /* Assigment of value for CH9 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH10_Pos                 _UINT32_(10)                                         /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH10_Msk                 (_UINT32_(0x1) << DMA_INTSTAT4_CH10_Pos)             /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH10(value)              (DMA_INTSTAT4_CH10_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH10_Pos)) /* Assigment of value for CH10 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH11_Pos                 _UINT32_(11)                                         /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH11_Msk                 (_UINT32_(0x1) << DMA_INTSTAT4_CH11_Pos)             /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH11(value)              (DMA_INTSTAT4_CH11_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH11_Pos)) /* Assigment of value for CH11 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH12_Pos                 _UINT32_(12)                                         /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH12_Msk                 (_UINT32_(0x1) << DMA_INTSTAT4_CH12_Pos)             /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH12(value)              (DMA_INTSTAT4_CH12_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH12_Pos)) /* Assigment of value for CH12 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH13_Pos                 _UINT32_(13)                                         /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH13_Msk                 (_UINT32_(0x1) << DMA_INTSTAT4_CH13_Pos)             /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH13(value)              (DMA_INTSTAT4_CH13_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH13_Pos)) /* Assigment of value for CH13 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH14_Pos                 _UINT32_(14)                                         /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH14_Msk                 (_UINT32_(0x1) << DMA_INTSTAT4_CH14_Pos)             /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH14(value)              (DMA_INTSTAT4_CH14_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH14_Pos)) /* Assigment of value for CH14 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH15_Pos                 _UINT32_(15)                                         /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH15_Msk                 (_UINT32_(0x1) << DMA_INTSTAT4_CH15_Pos)             /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH15(value)              (DMA_INTSTAT4_CH15_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH15_Pos)) /* Assigment of value for CH15 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH16_Pos                 _UINT32_(16)                                         /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH16_Msk                 (_UINT32_(0x1) << DMA_INTSTAT4_CH16_Pos)             /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH16(value)              (DMA_INTSTAT4_CH16_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH16_Pos)) /* Assigment of value for CH16 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH17_Pos                 _UINT32_(17)                                         /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH17_Msk                 (_UINT32_(0x1) << DMA_INTSTAT4_CH17_Pos)             /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH17(value)              (DMA_INTSTAT4_CH17_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH17_Pos)) /* Assigment of value for CH17 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH18_Pos                 _UINT32_(18)                                         /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH18_Msk                 (_UINT32_(0x1) << DMA_INTSTAT4_CH18_Pos)             /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH18(value)              (DMA_INTSTAT4_CH18_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH18_Pos)) /* Assigment of value for CH18 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH19_Pos                 _UINT32_(19)                                         /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH19_Msk                 (_UINT32_(0x1) << DMA_INTSTAT4_CH19_Pos)             /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH19(value)              (DMA_INTSTAT4_CH19_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH19_Pos)) /* Assigment of value for CH19 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH20_Pos                 _UINT32_(20)                                         /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH20_Msk                 (_UINT32_(0x1) << DMA_INTSTAT4_CH20_Pos)             /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH20(value)              (DMA_INTSTAT4_CH20_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH20_Pos)) /* Assigment of value for CH20 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH21_Pos                 _UINT32_(21)                                         /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH21_Msk                 (_UINT32_(0x1) << DMA_INTSTAT4_CH21_Pos)             /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH21(value)              (DMA_INTSTAT4_CH21_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH21_Pos)) /* Assigment of value for CH21 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH22_Pos                 _UINT32_(22)                                         /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH22_Msk                 (_UINT32_(0x1) << DMA_INTSTAT4_CH22_Pos)             /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH22(value)              (DMA_INTSTAT4_CH22_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH22_Pos)) /* Assigment of value for CH22 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_CH23_Pos                 _UINT32_(23)                                         /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Position */
#define DMA_INTSTAT4_CH23_Msk                 (_UINT32_(0x1) << DMA_INTSTAT4_CH23_Pos)             /* (DMA_INTSTAT4) DMA Channel active interrupt at priority 4 Mask */
#define DMA_INTSTAT4_CH23(value)              (DMA_INTSTAT4_CH23_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH23_Pos)) /* Assigment of value for CH23 in the DMA_INTSTAT4 register */
#define DMA_INTSTAT4_Msk                      _UINT32_(0x00FFFFFF)                                 /* (DMA_INTSTAT4) Register Mask  */

